tap "homebrew/services"
tap "minio/stable"
# All in one for **env
brew "anyenv"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Distributed revision control system
brew "git"
# Database migrations CLI tool
brew "golang-migrate"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Node.js version manager
brew "nodebrew"
# Development kit for the Java programming language
brew "openjdk@17"
# Object-relational database system
brew "postgresql@16", restart_service: :changed
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
vscode "1yib.rust-bundle"
vscode "4ops.terraform"
vscode "abusaidm.html-snippets"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "christian-kohler.path-intellisense"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "juanblanco.solidity"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msjsdiag.vscode-react-native"
vscode "ritwickdey.liveserver"
vscode "run-at-scale.terraform-doc-snippets"
vscode "rust-lang.rust-analyzer"
vscode "sidthesloth.html5-boilerplate"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
